module.exports = {
  config: {
    name: "hadis",
    aliases: ["hadees"],
    version: "1.5.0",
    role: 0,
    author: "SK-SIDDIK-KHAN",
    
    
    usages: "hadis",
    countDown: 5,
    description: {
            en: "Islamic Hadis"
        },
        category: "islam",
        guide: {
            en: "{pn}"
        }
},
    langs: {
        en: { syntaxError: "Please use the correct syntax: {pn}!" }
    },
  onStart: async function ({ api, event }) {
    const hadis = [
      "সৎ লোক সবার বিপদে পড়লে আবার উঠে কিন্তু অসৎ লোক বিপদে পড়লে একবারে নিপাত যায় ।— হযরত সুলাইমান (আঃ)",
      "সব দুঃখের মূল এই দুনিয়ার প্রতি অত্যাধিক আকর্ষণ ।— হযরত আলী (রাঃ)",
      "বিদ্বানের কলমের কালি শহীদের রক্তের চেয়েও পবিত্র ।— আল হাদিস",
      "ঝগড়া চরমে পৌঁছার আগেই ক্ষান্ত হও ।— হযরত সুলাইমান (আ:)",
      "আল্লাহর ভয় মানুষকে সকল ভয় হতে মুক্তি দেয় ।— ইবনে সিনা",
      "অসৎ লোক কাউকে সৎ মনে করে না, সকলকেই সে নিজের মত ভাবে ।— হযরত আলী (রাঃ)",
      "পুণ্য অর্জন অপেক্ষা পাপ বর্জন করা শ্রেষ্ঠতর ।— হযরত আলী (রাঃ)",
      "সে ব্যক্তি মুমিন নয়, যে নিজে তৃপ্তি সহকারে আহার করে অথচ তার প্রতিবেশী অনাহারে থাকে ।— হযরত মুহাম্মদ (সাঃ)",
      "আমি আল্লাহকে সবচেয়ে বেশি ভয় পাই, তারপর সেই মানুষকে ভয় পাই যে আল্লাহকে মোটেই ভয় পায় না ।— শেখ সাদী (রঃ)",
      "নিচু লোকের প্রধান হাতিয়ার হচ্ছে অশ্লীল বাক্য ।— হযরত আলী (রাঃ)",
      "যে নিজের মর্যাদা বোঝে না অন্যেও তার মর্যাদা দেয় না ।— হযরত আলী (রাঃ)",
      "অভ্যাসকে জয় করাই পরম বিজয় ।— হযরত আলী (রাঃ)",
      "যা তুমি নিজে করো না বা করতে পারো না তা অন্যকে উপদেশ দিও না ।— হযরত আলী (রাঃ)",
      "সত্য লোকের নিকট অপ্রিয় হলেও তা প্রচার করো ।— আল হাদিস",
      "আল্লাহ তা’আলার ভয়ে তুমি যা কিছু ছেড়ে দিবে, আল্লাহ তোমাকে তার চেয়ে উত্তম কিছু অবশ্যই দান করবেন ।— আল হাদিস",
      "নিজেই প্রতিশোধ নিও না, আল্লাহর জন্য অপেক্ষা কর। তাহলে তিনি তোমাকে রক্ষা করবেন।— হযরত সুলাইমান (আঃ)",
      "যে ব্যক্তি জুমু’আহর দিনে সূরা কাহাফ পাঠ করবে, তাঁর ঈমানের নূর এক জুমু’আহ হতে আরেক জুমু’আহ পর্যন্ত বিচ্ছুরিত হতে থাকবে।— সহীহ আত-তারগীব হা/৭৩৬",
      "দুনিয়াতে পরিচিত হওয়াই প্রকৃত খ্যাতি নয়। আসল খ্যাতি হলো আসমানে পরিচিতি পাওয়া।— বইঃ নবীজির সাথে",
      "নিশ্চই আল্লাহ তা’আলা সকল ব্যথিত ও চিন্তিত অন্তরকে ভালোবাসেন।— শু’আবুল ঈমান-৮৬৬",
      "যে রব (আল্লাহ্‌) গতকাল আপনার জন্য যথেষ্ট ছিলেন, তিনি আগামীকালও আপনার জন্য যথেষ্ট হবেন।— শাইখ আলী জাবের আল ফীকি হাফিযাহুল্লাহ",
      "ছোট ছোট গুনাহকে কখনো হালকা মনে করো না, কেননা সামান্য স্ফুলিঙ্গ থেকেই বড় অগ্নিকাণ্ডের সূত্রপাত হয়।— ইবনুল কাইয়্যিম রহঃ",
      "সবচেয়ে কষ্টকর বিষয় হচ্ছে যখন দেখবেন জান্নাত গোটা দুনিয়ার চেয়ে কয়েকগুণ বড় কিন্তু সেখানে আপনার জন্য কোন জায়গা নেই।",
      "সবচেয়ে উপকারী একটি ঔষধ হলো (দোয়া করতে থাকা) লেগে থাকা।— আল জাওয়াবুল কাফী, ১১",
      "অসহায়াত্ব রবের কাছে প্রকাশ করলে মর্যাদা বৃদ্ধি পায় আর মানুষের কাছে প্রকাশ করলে মর্যাদা হ্রাস পায়।— শাবিব তাশফি",
      "তোমাদের মধ্যে সে-ই উত্তম, যে তার পরিবার পরিজনের কাছে উত্তম।— ইবনে মাজাহ",
      "আল্লাহ ততোক্ষণ বান্দাহর সাহায্য করেন, যতোক্ষণ সে তার ভাইকে সহযোগীতা করে।— সহীহ মুসলিম",
      "যে পবিত্র থাকতে চায়, তাকে আল্লাহ পবিত্র রাখেন।— সহীহ বুখারী",
      "আল্লাহর পথে একটি সকাল কিংবা একটি সন্ধ্যা ব্যয় করা গোটা পৃথিবী এবং পৃথিবীর সমস্ত সম্পদের চেয়ে উত্তম।— বুখারী",
      "যে জ্ঞান অর্জনের খোঁজে বের হয়, সে আল্লাহর পথে বের হয়।— তিরমিযী",
      "প্রতিটি মানুষ তার কাজের সেই ফলই পাবে, যা সে নিয়্যত করেছে।— বুখারী",
      "তোমাদের মধ্যে সর্বোত্তম মানুষ তারাই, যাদের আচার আচরণ সবচেয়ে ভালো।— বুখারী",
      "অর্ধেকটা খেজুর দান করেও তোমরা নিজেদের জাহান্নাম থেকে বাঁচাতে পারো। যদি তা-ও না থাকে, তবে সুন্দর করে কথা বলো।— বুখারী",
      "এক ব্যক্তি রাসুল (স:) কে এসে বলল, আমাকে এমন কিছু শেখান যাতে আমি সুন্দর ভাবে জীবন কাটাতে পারি। রাসুল (স:) বললেন: রাগ করো না।— আল হাদিস",
      "একজন মুসলিম যদি গাছ লাগায়, অথবা জমি চাষ করে—যেখান থেকে পশু ও পাখিরা খেতে পারে—তাহলে সে একটি সদকা করল।— মুসলিম",
      "সব ধরনের দাগ দূর করার জন্য কিছু না কিছু আছে; মনের দাগ দূর করার জন্য আছে আল্লাহ্‌র স্মরণ।— বুখারী",
      "দয়ালুর প্রতি আল্লাহ্‌ও দয়াশীল হন। তাই, পৃথিবীর মানুষের প্রতি দয়াশীল হও, তাহলে যিনি আসমানে আছেন—তিনি তোমার প্রতি দয়া দেখাবেন।— আবু দাউদ, তিরমিযী",
      "সত্যিকার জ্ঞানী কারা?—যারা তাদের জ্ঞানকে বাস্তবে কাজে লাগায়।— বুখারী",
      "আল্লাহ্‌ আমার কাছে এই কথা প্রকাশ করেছেন যে, তোমাদের অবশ্যই বিনয়ী হতে হবে। কেউ কারও ওপর অহংকার করবে না, এবং কেউ কারও ওপর অত্যাচার করবে না।— মুসলিম",
      "কোন মানুষটি আল্লাহর কাছে সবচেয়ে প্রিয়?—যার মাধ্যমে আল্লাহ্‌র অন্য সৃষ্টিকূল উপকৃত হয়।— বুখারী"
    ];
    const randomHadis =
      hadis[Math.floor(Math.random() * hadis.length)];
    return api.sendMessage(
      `📖 ${randomHadis}`,
      event.threadID,
      null,
      event.messageID
    );
  }
};
